In [45]:
import pandas as pd

In [6]:
drinks = pd.read_csv('./drinks.csv')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [46]:
drinks.groupby('continent')['beer_servings'].mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

In [47]:
drinks.groupby('continent').agg(beer_mean_consumption=('beer_servings','mean')).sort_values('beer_mean_consumption', ascending=False).head(1)

           beer_mean_consumption
continent
EU                    193.777778

In [ ]:
drinks.groupby('continent').agg({'beer_servings':'mean'}).sort_values('beer_servings', ascending=False).to_dict()

Step 5. For each continent print the statistics for wine consumption.

In [ ]:
drinks.groupby('continent')['wine_servings'].describe()

In [ ]:
drinks.groupby('continent')['wine_servings']

Step 6. Print the mean alcohol consumption per continent for every column

In [ ]:
drinks.groupby('continent').agg(lambda x: x.mean())

In [ ]:
drinks.groupby('continent').mean()

In [ ]:
drinks.groupby('continent').agg({'country': 'size', 'beer_servings': ['sum', 'mean']})

In [9]:
drinks.groupby('continent').agg(lambda x: x.median())

/tmp/ipykernel_27908/2323432610.py:1: FutureWarning: ['country'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  drinks.groupby('continent').agg(lambda x: x.median())

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

Grouping Data: A Step-by-Step Tutorial to GroupBy in Pandas (https://www.kaggle.com/datasets/imdevskp/nobel-prize)

In [48]:
import pandas as pd
import numpy as np

In [13]:
import os
os.getcwd()

'/home/afghani/afghani_root_dir/JobSearch/code_practice/python/leetcode_practice/pandas_practice/guipsamora_github_exercises/03_Grouping'

In [58]:
nobel_df = pd.read_csv('../../practice_data/data_dir/NobelPrizeDataset/complete.csv')

In [59]:
nobel_df.columns

Index(['awardYear', 'category', 'categoryFullName', 'sortOrder', 'portion',
       'prizeAmount', 'prizeAmountAdjusted', 'dateAwarded', 'prizeStatus',
       'motivation', 'categoryTopMotivation', 'award_link', 'id', 'name',
       'knownName', 'givenName', 'familyName', 'fullName', 'penName', 'gender',
       'laureate_link', 'birth_date', 'birth_city', 'birth_cityNow',
       'birth_continent', 'birth_country', 'birth_countryNow',
       'birth_locationString', 'death_date', 'death_city', 'death_cityNow',
       'death_continent', 'death_country', 'death_countryNow',
       'death_locationString', 'orgName', 'nativeName', 'acronym',
       'org_founded_date', 'org_founded_city', 'org_founded_cityNow',
       'org_founded_continent', 'org_founded_country',
       'org_founded_countryNow', 'org_founded_locationString', 'ind_or_org',
       'residence_1', 'residence_2', 'affiliation_1', 'affiliation_2',
       'affiliation_3', 'affiliation_4'],
      dtype='object')

In [60]:
selected_cols = ['awardYear', 'category', 'prizeAmount', 'prizeAmountAdjusted', 'name', 'gender', 'birth_continent']
nobel_df1 = nobel_df[selected_cols].copy()

In [52]:
nobel_df1.columns

Index(['awardYear', 'category', 'prizeAmount', 'prizeAmountAdjusted', 'name',
       'gender', 'birth_continent'],
      dtype='object')

In [53]:
nobel_df.columns

Index(['awardYear', 'category', 'categoryFullName', 'sortOrder', 'portion',
       'prizeAmount', 'prizeAmountAdjusted', 'dateAwarded', 'prizeStatus',
       'motivation', 'categoryTopMotivation', 'award_link', 'id', 'name',
       'knownName', 'givenName', 'familyName', 'fullName', 'penName', 'gender',
       'laureate_link', 'birth_date', 'birth_city', 'birth_cityNow',
       'birth_continent', 'birth_country', 'birth_countryNow',
       'birth_locationString', 'death_date', 'death_city', 'death_cityNow',
       'death_continent', 'death_country', 'death_countryNow',
       'death_locationString', 'orgName', 'nativeName', 'acronym',
       'org_founded_date', 'org_founded_city', 'org_founded_cityNow',
       'org_founded_continent', 'org_founded_country',
       'org_founded_countryNow', 'org_founded_locationString', 'ind_or_org',
       'residence_1', 'residence_2', 'affiliation_1', 'affiliation_2',
       'affiliation_3', 'affiliation_4'],
      dtype='object')

In [39]:
nobel_df.awardYear * 10

0      20010
1      19750
2      20040
3      19820
4      19790
       ...
945    19720
946    19540
947    19110
948    19810
949    19630
Name: awardYear, Length: 950, dtype: int64

In [54]:
nobel_df.head()

,awardYear,category,prizeAmount,prizeAmountAdjusted,name,gender,birth_continent
0,2001,Economic Sciences,10000000,12295082,A. Michael Spence,male,North America
1,1975,Physics,630000,3404179,Aage N. Bohr,male,Europe
2,2004,Chemistry,10000000,11762861,Aaron Ciechanover,male,Asia
3,1982,Chemistry,1150000,3102518,Aaron Klug,male,Europe
4,1979,Physics,800000,2988048,Abdus Salam,male,Asia

In [43]:
nobel_df.groupby('category').mean()

/tmp/ipykernel_27908/2054195805.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df1.groupby('category').mean()

                          awardYear   prizeAmount  prizeAmountAdjusted
category
Chemistry               1972.347826  3.629279e+06         6.257868e+06
Economic Sciences       1996.119048  6.105845e+06         7.837779e+06
Literature              1960.931034  2.493811e+06         5.598256e+06
Peace                   1964.537313  3.124879e+06         6.163907e+06
Physics                 1971.065728  3.407939e+06         6.086978e+06
Physiology or Medicine  1970.356164  3.072973e+06         5.738301e+06

In [62]:
nobel_df1.groupby(['category', 'awardYear']).transform(sum)

/tmp/ipykernel_27908/3004994365.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  nobel_df1.groupby(['category', 'awardYear']).transform(sum)

     prizeAmount  prizeAmountAdjusted
0       30000000             36885246
1        1890000             10212537
2       30000000             35288583
3        1150000              3102518
4        2400000              8964144
..           ...                  ...
945      1440000             10037175
946       181647              2640218
947       140695              7327865
948      1000000              2929688
949       530000              5678572

[950 rows x 2 columns]

In [111]:
grouped = nobel_df1.groupby('category')

In [115]:
nobel_df1.groupby('category').indices

{'Chemistry': array([  2,   3,   7,   9,  10,  11,  13,  14,  15,  17,  19,  39,  62,
         64,  66,  71,  75,  80,  81,  86,  92, 104, 107, 112, 129, 135,
        153, 169, 175, 178, 181, 188, 197, 199, 203, 210, 215, 223, 227,
        239, 247, 249, 258, 264, 265, 268, 272, 274, 280, 282, 284, 289,
        296, 298, 310, 311, 317, 318, 337, 341, 343, 348, 352, 357, 362,
        365, 366, 372, 374, 384, 394, 395, 396, 415, 416, 419, 434, 440,
        442, 444, 446, 448, 450, 455, 456, 459, 461, 463, 465, 469, 475,
        504, 505, 508, 518, 522, 523, 524, 539, 549, 558, 559, 563, 567,
        571, 572, 585, 591, 596, 599, 627, 630, 632, 641, 643, 644, 648,
        659, 661, 666, 667, 668, 671, 673, 679, 681, 686, 713, 715, 717,
        719, 720, 722, 723, 725, 726, 729, 732, 738, 742, 744, 746, 751,
        756, 759, 763, 766, 773, 776, 798, 810, 813, 814, 817, 827, 828,
        829, 832, 839, 848, 853, 855, 862, 866, 880, 885, 886, 888, 889,
        892, 894, 897, 902, 904, 914, 915, 920, 921, 922, 940, 941, 943,
        946, 947]),
 'Economic Sciences': array([  0,   5,  45,  46,  58,  90,  96, 139, 140, 145, 152, 156, 157,
        180, 187, 193, 207, 219, 231, 232, 246, 250, 269, 279, 283, 295,
        305, 324, 346, 369, 418, 422, 425, 426, 430, 432, 438, 458, 467,
        476, 485, 510, 525, 527, 537, 538, 546, 580, 594, 595, 605, 611,
        636, 637, 657, 669, 670, 678, 700, 708, 716, 724, 734, 737, 739,
        745, 747, 749, 750, 753, 758, 767, 800, 805, 854, 856, 860, 864,
        871, 882, 896, 912, 916, 924]),
 'Literature': array([ 21,  31,  40,  49,  52,  98, 100, 101, 102, 111, 115, 142, 149,
        159, 170, 177, 201, 202, 220, 221, 233, 235, 237, 253, 257, 259,
        275, 277, 278, 286, 312, 315, 316, 321, 326, 333, 345, 347, 350,
        355, 359, 364, 370, 373, 385, 397, 400, 403, 406, 411, 435, 439,
        441, 454, 468, 479, 480, 482, 483, 492, 501, 506, 511, 516, 556,
        569, 581, 602, 604, 606, 613, 614, 618, 631, 633, 635, 640, 652,
        653, 655, 656, 665, 675, 683, 699, 761, 765, 771, 774, 777, 779,
        780, 784, 786, 788, 796, 799, 803, 836, 840, 842, 850, 861, 867,
        868, 878, 881, 883, 910, 917, 919, 927, 928, 929, 930, 936]),
 'Peace': array([  6,  12,  16,  25,  26,  27,  34,  36,  44,  47,  48,  54,  61,
         65,  72,  78,  79,  82,  95,  99, 116, 119, 120, 126, 137, 146,
        151, 166, 167, 171, 200, 204, 205, 206, 209, 213, 225, 236, 240,
        244, 255, 260, 266, 267, 270, 287, 303, 320, 329, 356, 360, 361,
        377, 386, 387, 388, 389, 390, 391, 392, 393, 433, 447, 449, 471,
        477, 481, 489, 491, 500, 512, 514, 517, 528, 529, 530, 533, 534,
        540, 542, 544, 545, 547, 553, 555, 560, 562, 574, 578, 590, 593,
        603, 607, 608, 609, 612, 615, 616, 617, 619, 620, 628, 634, 639,
        642, 664, 677, 688, 697, 703, 705, 710, 727, 736, 787, 793, 795,
        806, 823, 846, 847, 852, 865, 875, 876, 877, 895, 926, 934, 935,
        937, 944, 948, 949]),
 'Physics': array([  1,   4,   8,  20,  23,  24,  30,  32,  38,  51,  59,  60,  67,
         68,  69,  70,  74,  84,  89,  97, 103, 105, 108, 109, 114, 117,
        118, 122, 125, 127, 128, 130, 133, 141, 143, 144, 155, 162, 163,
        164, 165, 168, 173, 174, 176, 179, 183, 195, 212, 214, 216, 222,
        224, 228, 230, 234, 238, 241, 243, 251, 256, 263, 271, 276, 291,
        292, 297, 301, 306, 307, 308, 323, 327, 328, 330, 335, 336, 338,
        349, 351, 353, 354, 363, 367, 375, 376, 378, 381, 382, 398, 399,
        402, 404, 405, 408, 410, 412, 413, 420, 421, 424, 428, 429, 436,
        445, 451, 453, 457, 460, 462, 470, 472, 487, 495, 498, 499, 509,
        513, 515, 521, 526, 532, 535, 536, 541, 548, 550, 552, 557, 561,
        564, 565, 566, 573, 576, 577, 579, 583, 586, 588, 592, 601, 610,
        621, 622, 623, 629, 647, 650, 651, 654, 658, 674, 676, 682, 684,
        690, 691, 693, 694, 695, 696, 698, 702, 707, 711, 714, 721, 730,
        731, 735, 743, 752, 755, 770, 772, 775, 781, 785, 790, 792, 797,
        801, 802, 808, 822, 833, 834, 835, 844, 851, 870, 872, 879, 884,
        887, 890, 893, 900, 901, 903, 905, 907, 908, 909, 913, 925, 931,
        932, 933, 938, 942, 945]),
 'Physiology or Medicine': array([ 18,  22,  28,  29,  33,  35,  37,  41,  42,  43,  50,  53,  55,
         56,  57,  63,  73,  76,  77,  83,  85,  87,  88,  91,  93,  94,
        106, 110, 113, 121, 123, 124, 131, 132, 134, 136, 138, 147, 148,
        150, 154, 158, 160, 161, 172, 182, 184, 185, 186, 189, 190, 191,
        192, 194, 196, 198, 208, 211, 217, 218, 226, 229, 242, 245, 248,
        252, 254, 261, 262, 273, 281, 285, 288, 290, 293, 294, 299, 300,
        302, 304, 309, 313, 314, 319, 322, 325, 331, 332, 334, 339, 340,
        342, 344, 358, 368, 371, 379, 380, 383, 401, 407, 409, 414, 417,
        423, 427, 431, 437, 443, 452, 464, 466, 473, 474, 478, 484, 486,
        488, 490, 493, 494, 496, 497, 502, 503, 507, 519, 520, 531, 543,
        551, 554, 568, 570, 575, 582, 584, 587, 589, 597, 598, 600, 624,
        625, 626, 638, 645, 646, 649, 660, 662, 663, 672, 680, 685, 687,
        689, 692, 701, 704, 706, 709, 712, 718, 728, 733, 740, 741, 748,
        754, 757, 760, 762, 764, 768, 769, 778, 782, 783, 789, 791, 794,
        804, 807, 809, 811, 812, 815, 816, 818, 819, 820, 821, 824, 825,
        826, 830, 831, 837, 838, 841, 843, 845, 849, 857, 858, 859, 863,
        869, 873, 874, 891, 898, 899, 906, 911, 918, 923, 939])}

In [118]:
nobel_df1.groupby('category').get_group('Economic Sciences')

,awardYear,category,prizeAmount,prizeAmountAdjusted,name,gender,birth_continent
0,2001,Economic Sciences,10000000,12295082,A. Michael Spence,male,North America
5,2019,Economic Sciences,9000000,9000000,Abhijit Banerjee,male,Asia
45,2012,Economic Sciences,8000000,8361204,Alvin E. Roth,male,North America
46,1998,Economic Sciences,7600000,9713701,Amartya Sen,male,Asia
58,2015,Economic Sciences,8000000,8384572,Angus Deaton,male,Europe
...,...,...,...,...,...,...,...
882,2002,Economic Sciences,10000000,12034660,Vernon L. Smith,male,North America
896,1973,Economic Sciences,510000,3331882,Wassily Leontief,male,Europe
912,2018,Economic Sciences,9000000,9000000,William D. Nordhaus,male,North America
916,1990,Economic Sciences,4000000,6329114,William F. Sharpe,male,North America
924,1996,Economic Sciences,7400000,9490424,William Vickrey,male,North America

In [122]:
nobel_df1.groupby("category").agg(["mean", "sum"])

/tmp/ipykernel_27908/3697088024.py:1: FutureWarning: ['name', 'gender', 'birth_continent'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  nobel_df1.groupby("category").agg(["mean", "sum"])

                          awardYear           prizeAmount             \
                               mean     sum          mean        sum
category
Chemistry               1972.347826  362912  3.629279e+06  667787418
Economic Sciences       1996.119048  167674  6.105845e+06  512891000
Literature              1960.931034  227468  2.493811e+06  289282102
Peace                   1964.537313  263248  3.124879e+06  418733807
Physics                 1971.065728  419837  3.407939e+06  725890928
Physiology or Medicine  1970.356164  431508  3.072973e+06  672981066

                       prizeAmountAdjusted
                                      mean         sum
category
Chemistry                     6.257868e+06  1151447726
Economic Sciences             7.837779e+06   658373449
Literature                    5.598256e+06   649397731
Peace                         6.163907e+06   825963521
Physics                       6.086978e+06  1296526352
Physiology or Medicine        5.738301e+06  1256687857

In [123]:
nobel_df1.groupby('category')["prizeAmountAdjusted"].sum()

category
Chemistry                 1151447726
Economic Sciences          658373449
Literature                 649397731
Peace                      825963521
Physics                   1296526352
Physiology or Medicine    1256687857
Name: prizeAmountAdjusted, dtype: int64

In [124]:
nobel_df1.groupby("category").agg(sum_amt=("prizeAmountAdjusted", "sum"))

                           sum_amt
category
Chemistry               1151447726
Economic Sciences        658373449
Literature               649397731
Peace                    825963521
Physics                 1296526352
Physiology or Medicine  1256687857

In [125]:
nobel_df1.groupby("category").agg({"prizeAmountAdjusted": "sum"})

                        prizeAmountAdjusted
category
Chemistry                        1151447726
Economic Sciences                 658373449
Literature                        649397731
Peace                             825963521
Physics                          1296526352
Physiology or Medicine           1256687857

In [128]:
nobel_df1.groupby("category")[["prizeAmount", "prizeAmountAdjusted"]].size()

category
Chemistry                 184
Economic Sciences          84
Literature                116
Peace                     134
Physics                   213
Physiology or Medicine    219
dtype: int64

In [133]:
nobel_df1.groupby("category").agg({"prizeAmount" : ["sum", "size", "count"], "prizeAmountAdjusted": "mean"})

                       prizeAmount            prizeAmountAdjusted
                               sum size count                mean
category
Chemistry                667787418  184   184        6.257868e+06
Economic Sciences        512891000   84    84        7.837779e+06
Literature               289282102  116   116        5.598256e+06
Peace                    418733807  134   134        6.163907e+06
Physics                  725890928  213   213        6.086978e+06
Physiology or Medicine   672981066  219   219        5.738301e+06

In [139]:
nobel_df1.groupby("category")[["prizeAmount", "prizeAmountAdjusted"]].transform(lambda x: (x - x.mean()) / x.std() )

     prizeAmount  prizeAmount  prizeAmountAdjusted
0       1.028124     1.028124             1.345336
1      -0.692222    -0.692222            -0.814384
2       1.565061     1.565061             1.680387
3      -0.609072    -0.609072            -0.963164
4      -0.649861    -0.649861            -0.940704
..           ...          ...                  ...
945    -0.729600    -0.729600            -0.832128
946    -0.846962    -0.846962            -1.104280
947    -0.857022    -0.857022             0.326614
948    -0.540078    -0.540078            -1.013898
949    -0.726892    -0.726892            -1.042238

[950 rows x 3 columns]

In [140]:
nobel_df1.groupby("category").transform("sum")

/tmp/ipykernel_27908/2617874028.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  nobel_df1.groupby("category").transform("sum")

     awardYear  prizeAmount  prizeAmountAdjusted
0       167674    512891000            658373449
1       419837    725890928           1296526352
2       362912    667787418           1151447726
3       362912    667787418           1151447726
4       419837    725890928           1296526352
..         ...          ...                  ...
945     419837    725890928           1296526352
946     362912    667787418           1151447726
947     362912    667787418           1151447726
948     263248    418733807            825963521
949     263248    418733807            825963521

[950 rows x 3 columns]

In [143]:
df = pd.DataFrame({'A': range(10), 'B': range(1, 11)})
df

   A   B
0  0   1
1  1   2
2  2   3
3  3   4
4  4   5
5  5   6
6  6   7
7  7   8
8  8   9
9  9  10

    B
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [142]:
df['A'].transform(lambda x: x*5)

0     0
1     5
2    10
3    15
4    20
5    25
6    30
7    35
8    40
9    45
Name: A, dtype: int64

In [89]:
df['A'].transform([np.sqrt, np.exp])

       sqrt          exp
0  0.000000     1.000000
1  1.000000     2.718282
2  1.414214     7.389056
3  1.732051    20.085537
4  2.000000    54.598150
5  2.236068   148.413159
6  2.449490   403.428793
7  2.645751  1096.633158
8  2.828427  2980.957987
9  3.000000  8103.083928

In [147]:
df = pd.DataFrame({
    "Date": [
        "2015-05-08", "2015-05-07", "2015-05-06", "2015-05-05",
        "2015-05-08", "2015-05-07", "2015-05-06", "2015-05-05"],
    "Data": [5, 8, 6, 1, 50, 100, 60, 120],
})

In [148]:
df

         Date  Data
0  2015-05-08     5
1  2015-05-07     8
2  2015-05-06     6
3  2015-05-05     1
4  2015-05-08    50
5  2015-05-07   100
6  2015-05-06    60
7  2015-05-05   120

In [95]:
df.groupby('Date')['Data'].transform('sum')

0     55
1    108
2     66
3    121
4     55
5    108
6     66
7    121
Name: Data, dtype: int64

In [96]:
df = pd.DataFrame({
    "c": [1, 1, 1, 2, 2, 2, 2], 
    "type": ["m", "n", "o", "m", "m", "n", "n"] 
    })

In [107]:
df.groupby("c")["type"].transform('size')

0    3
1    3
2    3
3    4
4    4
5    4
6    4
Name: type, dtype: int64

In [108]:
df.groupby("c").ngroups

2

In [129]:
df = pd.DataFrame({'a':[0,0,1,2,2,2], 'b':[1,2,3,4,np.NaN,4], 'c':np.random.randn(6)})
df

   a    b         c
0  0  1.0 -0.174680
1  0  2.0 -0.951586
2  1  3.0  0.129075
3  2  4.0 -0.652067
4  2  NaN -1.157336
5  2  4.0  1.574004


#### What is the difference between size and count in pandas?
The other answers have pointed out the difference, however, it is not completely accurate to say "size counts NaNs while count does not". While size does indeed count NaNs, this is actually a consequence of the fact that size returns the size (or the length) of the object it is called on. Naturally, this also includes rows/values which are NaN.

In [131]:
df.groupby(["a"])["b"].count()

a
0    2
1    1
2    2
Name: b, dtype: int64

In [132]:
df.groupby("a")["b"].size()

a
0    2
1    1
2    3
Name: b, dtype: int64